rest/src/main/resources/soap-envelope-template.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
    <SOAP-ENV:Body>
        <personRequest xmlns="http://telanors.ru/soap/">
            <![CDATA[${body}]]>
        </personRequest>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>